CREATE TABLE jobs (
  job_id BIGSERIAL PRIMARY KEY NOT NULL,
  job_title VARCHAR(200) NOT NULL,
  education VARCHAR(200),
  profession VARCHAR(200),
  requirements TEXT,
  start_date DATE,
  end_date DATE
);

select * from jobs
select * from users

INSERT INTO jobs (job_title, education, profession, requirements, start_date, end_date) 
VALUES 
  ('Том тэрэгний жолооч1', 'Бүрэн дунд', 'кранчин', 'Хүнд даацын машины жолооч, С ангиллын жолоодох эрхтэй, С ангиллын мэргэшсэн жолооч байх', '2024-04-19', '2024-04-28'),
  ('Том тэрэгний жолооч2', 'Бүрэн дунд', 'кранчин', 'Хүнд даацын машины жолооч, С ангиллын жолоодох эрхтэй, С ангиллын мэргэшсэн жолооч байх', '2024-04-19', '2024-04-28'),
  ('Том тэрэгний жолооч3', 'Бүрэн дунд', 'кранчин', 'Хүнд даацын машины жолооч, С ангиллын жолоодох эрхтэй, С ангиллын мэргэшсэн жолооч байх', '2024-04-19', '2024-04-19');



CREATE TABLE tenders (
    id SERIAL PRIMARY KEY,
    tname VARCHAR(255) NOT NULL,
    start_date DATE NOT NULL,
    end_date DATE NOT NULL,
    is_foreign_tender VARCHAR(3) CHECK (is_foreign_tender IN ('yes', 'no')) DEFAULT 'no',
    is_previously_announced VARCHAR(3) CHECK (is_previously_announced IN ('yes', 'no')) DEFAULT 'no',
    details TEXT
);




INSERT INTO tenders (tname, start_date, end_date, is_foreign_tender, is_previously_announced, details)
VALUES
( 'нэгдсэн агуулахын 5-р өргөтгөл болон 2-2-р өргөтгөлийн ажил гүйцэтгэх', '2024-03-06', '2024-07-03', 'no', 'yes', '“ЭТГХ” ХХК нь “TN02375 УБИ нэгдсэн агуулахын 1-р өргөтгөл болон 2-2-р өргөтгөлийн ажил гүйцэтгэх” тендерийн гүйцэтгэгчийг сонгон шалгаруулах тул үнийн саналаа ирүүлэхийг урьж байна. Тендерийн материалыг 2023 оны 12 дугаар сарын 21-ны өдрийн 12:00 цагаас өмнө сайтаар хандаж үнийн санал болон баримт бичгийг цахимаар ирүүлнэ. Тендертэй холбоотой мэдээлэл өгөх хүмүүсийн албан тушаал холбогдох утасны дугаар: 989545852'),
( 'УБИ нэгдсэн агуулахын 1-р өргөтгөл болон 2-2-р өргөтгөлийн ажил гүйцэтгэх', '2024-03-06', '2024-03-06', 'no', 'yes', '“ЭТГХ” ХХК нь “TN02375 УБИ нэгдсэн агуулахын 1-р өргөтгөл болон 2-2-р өргөтгөлийн ажил гүйцэтгэх” тендерийн гүйцэтгэгчийг сонгон шалгаруулах тул үнийн саналаа ирүүлэхийг урьж байна. Тендерийн материалыг 2023 оны 12 дугаар сарын 21-ны өдрийн 12:00 цагаас өмнө сайтаар хандаж үнийн санал болон баримт бичгийг цахимаар ирүүлнэ. Тендертэй холбоотой мэдээлэл өгөх хүмүүсийн албан тушаал холбогдох утасны дугаар: 989545852')



select * from tenders;